# Data Aggregation/Summary Analysis 

### Education loans data

Let's analyze a few years of Federal direct loans <a href="https://studentaid.gov/data-center/student/title-iv">taken from here</a>.

For our exercise, we have <a href="https://raw.githubusercontent.com/sandeepmj/datasets/main/student-loan-data-comparable-quarters.csv">student loan data</a> for **first quarters** of academic years **2021-2022** and **2022-2023**.

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/sandeepmj/datasets/main/student-loan-data-comparable-quarters.csv")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8614 entries, 0 to 8613
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OPE ID         8614 non-null   int64
 1   School         8614 non-null   object
 2   State          8251 non-null   object
 3   zip            8614 non-null   object
 4   School Type    8614 non-null   object
 5   dl_sub_#       7972 non-null   float64
 6   dl_sub_$       7972 non-null   float64
 7   dl_unsub_#     7975 non-null   float64
 8   dl_unsub_$     7975 non-null   float64
 9   academic_year  8614 non-null   object
 10  Quarter        8614 non-null   int64
dtypes: float64(4), int64(2), object(5)
memory usage: 740.4+ KB

In [9]:
df.describe()

,OPE ID,dl_sub_#,dl_sub_$,dl_unsub_#,dl_unsub_$,Quarter
count,8.614000e+03,7972.000000,7.972000e+03,7975.000000,7.975000e+03,8614.0
mean,1.630314e+06,630.836051,1.239051e+06,686.005266,1.346809e+06,1.0
std,1.558731e+06,1412.327943,2.814541e+06,1555.280596,3.127407e+06,0.0
min,1.002000e+05,1.000000,6.800000e+01,1.000000,1.420000e+02,1.0
25%,2.853250e+05,19.000000,2.814250e+04,18.000000,3.269300e+04,1.0
50%,8.447500e+05,135.500000,2.195570e+05,136.000000,2.527800e+05,1.0
75%,3.099750e+06,600.000000,1.202372e+06,660.000000,1.264352e+06,1.0
max,4.304600e+06,24266.000000,5.200398e+07,26887.000000,7.101271e+07,1.0

In [15]:
pd.options.display.float_format = '{:,.0f}'.format

In [19]:
df.describe()

         OPE ID  dl_sub_#   dl_sub_$  dl_unsub_#  dl_unsub_$  Quarter
count     8,614     7,972      7,972       7,975       7,975    8,614
mean  1,630,314       631  1,239,051         686   1,346,809        1
std   1,558,731     1,412  2,814,541       1,555   3,127,407        0
min     100,200         1         68           1         142        1
25%     285,325        19     28,142          18      32,693        1
50%     844,750       136    219,557         136     252,780        1
75%   3,099,750       600  1,202,372         660   1,264,352        1
max   4,304,600    24,266 52,003,984      26,887  71,012,713        1

In [23]:
f"The total for all direct subsidized loans in Q1 of academic years was ${df['dl_sub_$'].sum():,.0F}"

'The total for all direct subsidized loans in Q1 of academic years was $9,877,712,740'

In [27]:
df["dl_sub_$"].std()

2814540.8940481567

In [31]:
df[["dl_sub_$", "dl_unsub_$"]].sum()

dl_sub_$      9,877,712,740
dl_unsub_$   10,740,802,223
dtype: float64

In [33]:
df[["dl_sub_$", "dl_unsub_$"]].sum().to_frame("Total Loan Amounts")

            Total Loan Amounts
dl_sub_$         9,877,712,740
dl_unsub_$      10,740,802,223

In [35]:
df["dl_sub_$"].agg(["sum", "median", "max"])

sum      9,877,712,740
median         219,557
max         52,003,984
Name: dl_sub_$, dtype: float64

In [37]:
target_stats = ["sum", "mean", "median", "std"]

In [39]:
df["dl_sub_$"].agg(target_stats).to_frame("Direct Subsidized Loans")

        Direct Subsidized Loans
sum               9,877,712,740
mean                  1,239,051
median                  219,557
std                   2,814,541

In [41]:
df[["dl_sub_$", "dl_unsub_$"]].agg(target_stats)

            dl_sub_$     dl_unsub_$
sum    9,877,712,740 10,740,802,223
mean       1,239,051      1,346,809
median       219,557        252,780
std        2,814,541      3,127,407